export default {
  state: {
    modalEventId: null,
    events: [
      {
        id: 1,
        name: "Физтех_Weekend.png",
        header: "Физтех Weekend",
        text: 'Наша команда предлагает студентам выезд на природу на выходных. Это возможность познакомиться со своими однокурсниками и отлично провести время на природе! Вас ждут интересные командные игры, жаренные сосиски, песни под гитару, загадочная игра "мамонты", а также многие другие активности.',
        photos: [
          "Физтех_Weekend/o6J75j4w9yY.jpg",
          "Физтех_Weekend/OfbuY7Kc02I.jpg",
          "Физтех_Weekend/T21Grln6JP8.jpg",
          "Физтех_Weekend/yng9FJN5S8E.jpg",
        ],
        videoURL:
          "https://vk.com/video_ext.php?oid=-8864093&id=456239089&hash=660512d2b7f0f555&hd4",
      },
      {
        id: 2,
        name: "Дебют_первокурсников.png",
        header: "Дебют первокурсников",
        text: "Это самое яркое событие для всех первокурсников. Каждый год мы встречаем новоприбывших студентов и раскрываем их таланты, помогаем познакомиться с институтом и сплотиться со своей группой. Сначала мы готовим ребят к институтскому этапу, а затем к университетскому. Мы организовываем редактуры, помогаем прописывать сценарий, придумывать шутки, делаем все возможное, чтобы вы смогли раскрыть себя.",
        photos: [
          "Дебют_первокурсников/ESn3LiDxFi0.jpg",
          "Дебют_первокурсников/J3EWaa-acpo.jpg",
          "Дебют_первокурсников/U1KUU-MYr7s.jpg",
          "Дебют_первокурсников/zc5j6AgsGKI.jpg",
        ],
        videoURL:
          "https://vk.com/video_ext.php?oid=244221033&id=456239215&hash=817210c12a1b7ec3&hd=4",
      },
      {
        id: 3,
        name: "Слет_ФТИ.png",
        header: "Слет ФТИ",
        text: "Слет - это два дня, которые запомнятся на всю жизнь. Классная команда и крутая компания, множество воспоминаний и самое яркое шоу, погружение в другой мир, новые нити знакомств, более 150 участников ежегодно. Это одно из самых ярких мероприятий твоего студенчества, которое запомнится на всю жизнь.",
        photos: [
          "Слет_ФТИ/2pKzpCM5Yow.jpg",
          "Слет_ФТИ/8unq5ORLgvE.jpg",
          "Слет_ФТИ/HMx_llOkYe4.jpg",
          "Слет_ФТИ/z_2QW7-8S9o.jpg",
        ],
        videoURL:
          "https://vk.com/video_ext.php?oid=-8864093&id=456239117&hash=a98b850449993c07&hd=4",
      },
      {
        id: 4,
        name: "ЧтоГдеКогда.png",
        header: "Что? Где? Когда?",
        text: "Знакомая всем классическая интеллектуально-развлекательная игра, направленная на проверку знаний в различных областях науки и жизни. Участвовать можно командой от 4 до 6 человек.",
        photos: [
          "ЧтоГдеКогда/4OaaMZtg7JQ.jpg",
          "ЧтоГдеКогда/fKTESGDC60Y.jpg",
          "ЧтоГдеКогда/uOkAmRVkvVE.jpg",
          "ЧтоГдеКогда/zvQ43J3iCVM.jpg",
        ],
      },
      {
        id: 5,
        name: "Школа_студенческого_актива.png",
        header: "Слет ШСА",
        text: "Выездной слет для лучших 25 участников школы студенческого актива. 2 дня насыщенной программы: интересные знакомства, новые навыки, увлекательные мастер-классы, уникальная ролевая игра, а также подготовка своего собственного проекта!",
        photos: [
          "Школа_студенческого_актива/1DTfNdayc7I.jpg",
          "Школа_студенческого_актива/4ftfYPMI1nE.jpg",
          "Школа_студенческого_актива/D4RtlugTwLM.jpg",
          "Школа_студенческого_актива/LQyR2KokgrI.jpg",
        ],
        videoURL:
          "https://vk.com/video_ext.php?oid=-8864093&id=456239104&hash=1beddb55d9e84668&hd=4",
      },
      {
        id: 6,
        name: "Квест.jpg",
        header: "Квест",
        text: "Тематический развлекательный квест по студенческому городку. Квест подарит вам новые знакомства и эмоции, позволит почувстовать себя внутри тематической вселенной и пройти интересные этапы, придуманные специально под данную тематику. Также квест помогает первокурсникам познакомиться корпусами и основными местами университета.",
        photos: [
          "Квест/Jvm3UpGr2R8.jpg",
          "Квест/lj6FOao_AlE.jpg",
          "Квест/sHux6BDjMuI.jpg",
          "Квест/vqWirbOLEaw.jpg",
        ],
      },
      {
        id: 7,
        name: "Международная_конференция_ФТИ.png",
        header: "Международная конференция ФТИ",
        text: "Это самое яркое событие для всех первокурсников. Каждый год мы встречаем новоприбывших студентов и раскрываем их таланты, помогаем познакомиться с институтом и сплотиться со своей группой. Сначала мы готовим ребят к институтскому этапу, а затем к университетскому. Мы организовываем редактуры, помогаем прописывать сценарий, придумывать шутки, делаем все возможное, чтобы вы смогли раскрыть себя.",
        photos: [
          "Международная_конференция_ФТИ/CkckNY4IAhk.jpg",
          "Международная_конференция_ФТИ/DgOpkQ0VC-Y.jpg",
          "Международная_конференция_ФТИ/p7U8oX_V74Y.jpg",
          "Международная_конференция_ФТИ/U0I4xT747pY.jpg",
        ],
      },
      {
        id: 8,
        name: "Выпускной.png",
        header: "Выпускной",
        text: "Одно из самых запоминающихся событий в жизни каждого человека. Ведь это начало совершенно новой, взрослой жизни. День рукопожатий и объятий. День улыбок, конфедераток и танцев. Для всех одинаковый, для каждого свой.",
        photos: [
          "Выпускной/ATcPp68MG1w.jpg",
          "Выпускной/fClJe0rd5zM.jpg",
          "Выпускной/w0s5AYGE9QY.jpg",
          "Выпускной/wHD6XP7acyE.jpg",
        ],
        videoURL:
          "https://vk.com/video_ext.php?oid=-67188831&id=456239097&hash=831cd0907eae1954&hd=4",
      },
      {
        id: 9,
        name: "Фотопрогулка.jpg",
        header: "Фотопрогулка",
        text: "Прохождение маршрута по интересным местам с фотографами Союза студентов ФТИ. Места определяются заранее при открытии регистрации на мероприятие. Если хочешь наконец обновить себе аватарку или получить крутые фотки и хорошо провести время вместе с друзьями, то это мероприятие точно для тебя.",
        photos: [
          "Фотопрогулка/6o0qLSA9GG4.jpg",
          "Фотопрогулка/j9ymF9BosWk.jpg",
          "Фотопрогулка/pmNSadyFcjo.jpg",
          "Фотопрогулка/z8k9CQApZvU.jpg",
        ],
      },
    ],
  },
  getters: {
    getAllEvents(state) {
      return state.events;
    },
    getModalEventId(state) {
      console.log(state.modalEventId);
      return state.events[state.modalEventId - 1];
    },
  },
  mutations: {
    setModalEventId(state, id) {
      state.modalEventId = id;
    },
  },
  actions: {},
};
